Tekla Open API Reference for Tekla Structures 2025
GridCylindricalSurface Constructor
Overload List
Name | Description
GridCylindricalSurface()
 Creates a new grid plane instance.
The default values are as follows:
CylinderBase = new Arc(new Point(0, 0, 0), new Point(6000, 0, 0), new Vector(0, 0, 1), Math.PI);
CylinderHeight = 6000.0;
Label = "Default";
IsMagnetic = false;
ExtensionLeft = 2000.0;
ExtensionRight = 2000.0;
ExtensionBelow = 2000.0;
ExtensionAbove = 2000.0;
DrawingVisibility = false;
GridCylindricalSurface(Arc, Double, String)
 Creates a new grid plane instance taking the plane and label as input.
Top
See Also
Reference
GridCylindricalSurface Class
Tekla.Structures.Model Namespace